In [413]:
import pandas as pd

In [415]:
# general practice - 1. Create a DataFrame from List
student_data = [[1, 15], [2, 11], [3, 11], [4, 20]]

df = pd.DataFrame(student_data,)
# df.rename(columns={0:'student_id', 1:'age'}) # this is alternate way
df.columns = ["student_id", "age"]
df

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

In [417]:
# 1. Create a DataFrame from List

def createDataframe(student_data) -> pd.DataFrame:
    column_names = ['student_id','age']
    df = pd.DataFrame(student_data, columns = column_names)
    return df

student_data = [[1, 15], [2, 11], [3, 11], [4, 20]]
createDataframe(student_data)

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

In [419]:
# general practice - 2. Get the Size of a DataFrame
excel_file = pd.ExcelFile("general_practice.xlsx")
players = pd.read_excel(excel_file, 'players')
players

   player_id      name  age     position                team
0        846     Mason   21      Forward          RealMadrid
1        749     Riley   30       Winger           Barcelona
2        155       Bob   28      Striker    ManchesterUnited
3        583  Isabella   32   Goalkeeper           Liverpool
4        388   Zachary   24   Midfielder        BayernMunich
5        883       Ava   23     Defender             Chelsea
6        355    Violet   18      Striker            Juventus
7        247    Thomas   27      Striker  ParisSaint-Germain
8        761      Jack   33   Midfielder      ManchesterCity
9        642   Charlie   36  Center-back             Arsenal

In [421]:
players.shape

(10, 5)

In [423]:
# return the size as list
print(list(players.shape))

[10, 5]

In [425]:
# 2. Get the Size of a DataFrame
def getDataframeSize(players):
    df = pd.DataFrame(players)
    size = list(df.shape)
    return size

getDataframeSize(players)

[10, 5]

In [427]:
# general practice 3. Display the First Three Rows
excel_file = pd.ExcelFile("general_practice.xlsx")
employees = pd.read_excel(excel_file, 'employees')
employees

   employee_id       name             department  salary
0            3        Bob             Operations   48675
1           90      Alice                  Sales   11096
2            9    Tatiana            Engineering   33805
3           60  Annabelle  InformationTechnology   37678
4           49   Jonathan         HumanResources   23793
5           43     Khaled         Administration   40454

In [429]:
employees.head(3)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

In [431]:
# 3. Display the First Three Rows
def selectFirstRows(employees):
    df = pd.DataFrame(employees)
    return df.head(3)
    
selectFirstRows(employees)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

In [433]:
# general pratice -  4. select Data

excel_file = pd.ExcelFile("general_practice.xlsx")
students = pd.read_excel(excel_file, "students")
students

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11
4          32    Piper    5
5         217      NaN   19
6         779  Georgia   20
7         849   Willow   14

In [435]:
# select the name and age of the student with student_id = 101
selected_data = students[students["student_id"]==101]
selected_data

   student_id     name  age
0         101  Ulysses   13

In [437]:
# selected_data[['name', 'age']]

# or 

selected_data = students[students['student_id']==101][["name","age"]]
selected_data

      name  age
0  Ulysses   13

In [439]:
# 4. select Data
def selectData(students: pd.DataFrame) -> pd.DataFrame:
    df = pd.DataFrame(students)
    return df[df["student_id"]==101][['name','age']]

selectData(students)

      name  age
0  Ulysses   13

In [441]:
# general practice 5. Create a New Column
excel_file = pd.ExcelFile("general_practice.xlsx")
employees = pd.read_excel(excel_file, "employees")
employees

   employee_id       name             department  salary
0            3        Bob             Operations   48675
1           90      Alice                  Sales   11096
2            9    Tatiana            Engineering   33805
3           60  Annabelle  InformationTechnology   37678
4           49   Jonathan         HumanResources   23793
5           43     Khaled         Administration   40454

In [443]:
# create a new column name bonus that contains the doubled values of the salary column.

employees['bonus'] = employees['salary'] * 2
employees

   employee_id       name             department  salary  bonus
0            3        Bob             Operations   48675  97350
1           90      Alice                  Sales   11096  22192
2            9    Tatiana            Engineering   33805  67610
3           60  Annabelle  InformationTechnology   37678  75356
4           49   Jonathan         HumanResources   23793  47586
5           43     Khaled         Administration   40454  80908

In [445]:
# 5. Create a New Column
def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    df = pd.DataFrame(employees)
    df['bonus'] = df['salary'] * 2
    return df

createBonusColumn(employees)

   employee_id       name             department  salary  bonus
0            3        Bob             Operations   48675  97350
1           90      Alice                  Sales   11096  22192
2            9    Tatiana            Engineering   33805  67610
3           60  Annabelle  InformationTechnology   37678  75356
4           49   Jonathan         HumanResources   23793  47586
5           43     Khaled         Administration   40454  80908

In [447]:
# general practice - 6. Drop Duplicate Rows
excel_file = pd.ExcelFile("general_practice.xlsx")
customers = pd.read_excel(excel_file, 'customers')
customers

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com
5            6   Violet    alice@example.com

In [449]:
# Write a solution to remove these duplicate rows and keep only the first occurrence.
customers.drop_duplicates(subset = ['email'], keep='first', inplace = True)
customers

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

In [451]:
# 6. Drop Duplicate Rows
def dropDuplicateEmails(customers):
    df = pd.DataFrame(customers)
    df.drop_duplicates(subset=['email'], keep='first', inplace=True)
    return df

dropDuplicateEmails(customers)

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

In [490]:
# general practice - 7. Drop missing data
excel_file_name = "general_practice.xlsx"
sheet = "students"
excel_file = pd.ExcelFile(excel_file_name)
students = pd.read_excel(excel_file_name, sheet)
students

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11
4          32    Piper    5
5         217      NaN   19
6         779  Georgia   20
7         849   Willow   14

In [482]:
# Write a solution to remove the rows with missing values.in column name
# if students['name'].isna:
students.dropna(subset=['name'],inplace=True)
students

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11
4          32    Piper    5
6         779  Georgia   20
7         849   Willow   14

In [498]:
def dropMissingData(students: pd.DataFrame) -> pd.DataFrame:
    df = pd.DataFrame(students)
    df.dropna(subset=['name'],inplace=True)
    return df

dropMissingData(students)

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11
4          32    Piper    5
6         779  Georgia   20
7         849   Willow   14